static-benchmark-results/vllm_isl1000_osl1000_tp1_static/concurrency=64/bench.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f2593449620>, trust_remote_code=False, seed=0, num_prompts=192, dataset_name='sharegpt', no_stream=False, dataset_path='/localhome/local-triv/benchmark/datasets/fixed_isl1000.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=1000, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='meta-llama/Meta-Llama-3.1-8B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/localhome/local-triv/benchmark/static-benchmark-results/vllm_isl1000_osl1000_tp1_static/concurrency=64', result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-bf14d61d-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 192/192 [03:43<00:00,  1.16s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     192       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  223.42    
Total input tokens:                      192192    
Total generated tokens:                  192000    
Request throughput (req/s):              0.86      
Output token throughput (tok/s):         859.38    
Peak output token throughput (tok/s):    2112.00   
Peak concurrent requests:                89.00     
Total token throughput (tok/s):          1719.62   
---------------Time to First Token----------------
Mean TTFT (ms):                          4787.73   
Median TTFT (ms):                        5668.64   
P99 TTFT (ms):                           8084.74   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          69.71     
Median TPOT (ms):                        70.61     
P99 TPOT (ms):                           76.51     
---------------Inter-token Latency----------------
Mean ITL (ms):                           69.71     
Median ITL (ms):                         63.51     
P99 ITL (ms):                            79.24     
==================================================